NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/incompressible/overPimpleDyMFoam/twoSimpleRotors/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType   laminar;

RAS
{
    RASModel    kEpsilon;

    turbulence      on;

    printCoeffs     on;
}


// ************************************************************************* //
